#+PROPERTY: header-args:sql    :exports both
#+PROPERTY: header-args:sql+    :engine postgresql
#+PROPERTY: header-args:sql+    :dbhost localhost
#+PROPERTY: header-args:sql+    :dbuser akvo
#+PROPERTY: header-args:sql+    :dbpassword password
#+PROPERTY: header-args:sql+    :database rtmis
#+PROPERTY: header-args :tangle data-model.sql
#+STARTUP: showall

#+NAME: RTMIS Database
#+begin_src sql
\d
#+end_src

#+RESULTS: RTMIS Database
| List of relations |                                     |                   |       |
|-------------------+-------------------------------------+-------------------+-------|
| Schema            | Name                                | Type              | Owner |
| public            | access                              | table             | akvo  |
| public            | access_id_seq                       | sequence          | akvo  |
| public            | administrator                       | table             | akvo  |
| public            | administrator_id_seq                | sequence          | akvo  |
| public            | answer                              | table             | akvo  |
| public            | answer_history                      | table             | akvo  |
| public            | answer_history_id_seq               | sequence          | akvo  |
| public            | answer_id_seq                       | sequence          | akvo  |
| public            | auth_group                          | table             | akvo  |
| public            | auth_group_id_seq                   | sequence          | akvo  |
| public            | auth_group_permissions              | table             | akvo  |
| public            | auth_group_permissions_id_seq       | sequence          | akvo  |
| public            | auth_permission                     | table             | akvo  |
| public            | auth_permission_id_seq              | sequence          | akvo  |
| public            | batch                               | table             | akvo  |
| public            | batch_comment                       | table             | akvo  |
| public            | batch_comment_id_seq                | sequence          | akvo  |
| public            | batch_id_seq                        | sequence          | akvo  |
| public            | data                                | table             | akvo  |
| public            | data_category                       | materialized view | akvo  |
| public            | data_id_seq                         | sequence          | akvo  |
| public            | django_admin_log                    | table             | akvo  |
| public            | django_admin_log_id_seq             | sequence          | akvo  |
| public            | django_content_type                 | table             | akvo  |
| public            | django_content_type_id_seq          | sequence          | akvo  |
| public            | django_migrations                   | table             | akvo  |
| public            | django_migrations_id_seq            | sequence          | akvo  |
| public            | django_q_ormq                       | table             | akvo  |
| public            | django_q_ormq_id_seq                | sequence          | akvo  |
| public            | django_q_schedule                   | table             | akvo  |
| public            | django_q_schedule_id_seq            | sequence          | akvo  |
| public            | django_q_task                       | table             | akvo  |
| public            | django_session                      | table             | akvo  |
| public            | form                                | table             | akvo  |
| public            | form_approval_assignment            | table             | akvo  |
| public            | form_approval_assignment_id_seq     | sequence          | akvo  |
| public            | form_approval_rule                  | table             | akvo  |
| public            | form_approval_rule_id_seq           | sequence          | akvo  |
| public            | form_approval_rule_levels           | table             | akvo  |
| public            | form_approval_rule_levels_id_seq    | sequence          | akvo  |
| public            | form_id_seq                         | sequence          | akvo  |
| public            | jobs                                | table             | akvo  |
| public            | jobs_id_seq                         | sequence          | akvo  |
| public            | levels                              | table             | akvo  |
| public            | levels_id_seq                       | sequence          | akvo  |
| public            | option                              | table             | akvo  |
| public            | option_id_seq                       | sequence          | akvo  |
| public            | organisation                        | table             | akvo  |
| public            | organisation_attribute              | table             | akvo  |
| public            | organisation_attribute_id_seq       | sequence          | akvo  |
| public            | organisation_id_seq                 | sequence          | akvo  |
| public            | pending_answer                      | table             | akvo  |
| public            | pending_answer_history              | table             | akvo  |
| public            | pending_answer_history_id_seq       | sequence          | akvo  |
| public            | pending_answer_id_seq               | sequence          | akvo  |
| public            | pending_data                        | table             | akvo  |
| public            | pending_data_approval               | table             | akvo  |
| public            | pending_data_approval_id_seq        | sequence          | akvo  |
| public            | pending_data_id_seq                 | sequence          | akvo  |
| public            | question                            | table             | akvo  |
| public            | question_attribute                  | table             | akvo  |
| public            | question_attribute_id_seq           | sequence          | akvo  |
| public            | question_group                      | table             | akvo  |
| public            | question_group_id_seq               | sequence          | akvo  |
| public            | question_id_seq                     | sequence          | akvo  |
| public            | system_user                         | table             | akvo  |
| public            | system_user_groups                  | table             | akvo  |
| public            | system_user_groups_id_seq           | sequence          | akvo  |
| public            | system_user_id_seq                  | sequence          | akvo  |
| public            | system_user_user_permissions        | table             | akvo  |
| public            | system_user_user_permissions_id_seq | sequence          | akvo  |
| public            | user_form                           | table             | akvo  |
| public            | user_form_id_seq                    | sequence          | akvo  |
| public            | view_data_options                   | materialized view | akvo  |
| public            | view_jmp_count                      | materialized view | akvo  |
| public            | view_jmp_criteria                   | materialized view | akvo  |
| public            | view_jmp_data                       | materialized view | akvo  |
| public            | view_options                        | materialized view | akvo  |
| public            | view_pending_approval               | view              | akvo  |

#+name: Database
#+begin_src sql
SELECT
    ordinal_position as pos,
    table_name,
    column_name,
    is_nullable,
    data_type,
    character_maximum_length as len,
    column_default as default
FROM   information_schema.columns
WHERE  table_name IN (
    'levels',
    'administrator',
    'access',
    'data_category',
    'jobs',
    'form',
    'form_approval_rule',
    'form_approval_assignment',
    'question_group',
    'question',
    'option',
    'user_form',
    'question_attribute',
    'organisation',
    'organisation_attribute',
    'system_user',
    'data',
    'batch',
    'batch_comment',
    'pending_data',
    'pending_data_approval',
    'pending_answer',
    'pending_answer_history',
    'answer',
    'answer_history'
)
ORDER  BY table_name, ordinal_position;
#+end_src

| pos | table_name               | column_name       | is_nullable | data_type                | len | default                                              |
|-----+--------------------------+-------------------+-------------+--------------------------+-----+------------------------------------------------------|
|   1 | access                   | id                | NO          | bigint                   |     | nextval('access_id_seq'::regclass)                   |
|   2 | access                   | role              | NO          | integer                  |     |                                                      |
|   3 | access                   | administration_id | NO          | bigint                   |     |                                                      |
|   4 | access                   | user_id           | NO          | bigint                   |     |                                                      |
|     |                          |                   |             |                          |     |                                                      |
| pos | table_name               | column_name       | is_nullable | data_type                | len | default                                              |
|-----+--------------------------+-------------------+-------------+--------------------------+-----+------------------------------------------------------|
|   1 | administrator            | id                | NO          | bigint                   |     | nextval('administrator_id_seq'::regclass)            |
|   2 | administrator            | code              | YES         | character varying        | 255 |                                                      |
|   3 | administrator            | name              | NO          | text                     |     |                                                      |
|   4 | administrator            | level_id          | NO          | bigint                   |     |                                                      |
|   5 | administrator            | parent_id         | YES         | bigint                   |     |                                                      |
|   6 | administrator            | path              | YES         | text                     |     |                                                      |
|-----+--------------------------+-------------------+-------------+--------------------------+-----+------------------------------------------------------|
|   1 | answer                   | id                | NO          | bigint                   |     | nextval('answer_id_seq'::regclass)                   |
|   2 | answer                   | name              | YES         | text                     |     |                                                      |
|   3 | answer                   | value             | YES         | double precision         |     |                                                      |
|   4 | answer                   | options           | YES         | jsonb                    |     |                                                      |
|   5 | answer                   | created           | NO          | timestamp with time zone |     |                                                      |
|   6 | answer                   | updated           | YES         | timestamp with time zone |     |                                                      |
|   7 | answer                   | created_by_id     | NO          | bigint                   |     |                                                      |
|   8 | answer                   | data_id           | NO          | bigint                   |     |                                                      |
|   9 | answer                   | question_id       | NO          | bigint                   |     |                                                      |
|-----+--------------------------+-------------------+-------------+--------------------------+-----+------------------------------------------------------|
|   1 | answer_history           | id                | NO          | bigint                   |     | nextval('answer_history_id_seq'::regclass)           |
|   2 | answer_history           | name              | YES         | text                     |     |                                                      |
|   3 | answer_history           | value             | YES         | double precision         |     |                                                      |
|   4 | answer_history           | options           | YES         | jsonb                    |     |                                                      |
|   5 | answer_history           | created           | NO          | timestamp with time zone |     |                                                      |
|   6 | answer_history           | updated           | YES         | timestamp with time zone |     |                                                      |
|   7 | answer_history           | created_by_id     | NO          | bigint                   |     |                                                      |
|   8 | answer_history           | data_id           | NO          | bigint                   |     |                                                      |
|   9 | answer_history           | question_id       | NO          | bigint                   |     |                                                      |
|-----+--------------------------+-------------------+-------------+--------------------------+-----+------------------------------------------------------|
|   1 | batch                    | id                | NO          | bigint                   |     | nextval('batch_id_seq'::regclass)                    |
|   2 | batch                    | name              | NO          | text                     |     |                                                      |
|   3 | batch                    | uuid              | YES         | uuid                     |     |                                                      |
|   4 | batch                    | file              | YES         | character varying        | 200 |                                                      |
|   5 | batch                    | created           | NO          | timestamp with time zone |     |                                                      |
|   6 | batch                    | updated           | YES         | timestamp with time zone |     |                                                      |
|   7 | batch                    | administration_id | NO          | bigint                   |     |                                                      |
|   8 | batch                    | form_id           | NO          | bigint                   |     |                                                      |
|   9 | batch                    | user_id           | NO          | bigint                   |     |                                                      |
|  10 | batch                    | approved          | NO          | boolean                  |     |                                                      |
|-----+--------------------------+-------------------+-------------+--------------------------+-----+------------------------------------------------------|
|   1 | batch_comment            | id                | NO          | bigint                   |     | nextval('batch_comment_id_seq'::regclass)            |
|   2 | batch_comment            | comment           | NO          | text                     |     |                                                      |
|   3 | batch_comment            | created           | NO          | timestamp with time zone |     |                                                      |
|   4 | batch_comment            | batch_id          | NO          | bigint                   |     |                                                      |
|   5 | batch_comment            | user_id           | NO          | bigint                   |     |                                                      |
|-----+--------------------------+-------------------+-------------+--------------------------+-----+------------------------------------------------------|
|   1 | data                     | id                | NO          | bigint                   |     | nextval('data_id_seq'::regclass)                     |
|   2 | data                     | name              | NO          | text                     |     |                                                      |
|   3 | data                     | geo               | YES         | jsonb                    |     |                                                      |
|   4 | data                     | created           | NO          | timestamp with time zone |     |                                                      |
|   5 | data                     | updated           | YES         | timestamp with time zone |     |                                                      |
|   6 | data                     | administration_id | NO          | bigint                   |     |                                                      |
|   7 | data                     | created_by_id     | NO          | bigint                   |     |                                                      |
|   8 | data                     | form_id           | NO          | bigint                   |     |                                                      |
|   9 | data                     | updated_by_id     | YES         | bigint                   |     |                                                      |
|-----+--------------------------+-------------------+-------------+--------------------------+-----+------------------------------------------------------|
|   1 | form                     | id                | NO          | bigint                   |     | nextval('form_id_seq'::regclass)                     |
|   2 | form                     | name              | NO          | text                     |     |                                                      |
|   3 | form                     | version           | NO          | integer                  |     |                                                      |
|   4 | form                     | uuid              | NO          | uuid                     |     |                                                      |
|   5 | form                     | type              | YES         | integer                  |     |                                                      |
|-----+--------------------------+-------------------+-------------+--------------------------+-----+------------------------------------------------------|
|   1 | form_approval_assignment | id                | NO          | bigint                   |     | nextval('form_approval_assignment_id_seq'::regclass) |
|   2 | form_approval_assignment | updated           | YES         | timestamp with time zone |     |                                                      |
|   3 | form_approval_assignment | administration_id | NO          | bigint                   |     |                                                      |
|   4 | form_approval_assignment | form_id           | NO          | bigint                   |     |                                                      |
|   5 | form_approval_assignment | user_id           | NO          | bigint                   |     |                                                      |
|   1 | form_approval_rule       | id                | NO          | bigint                   |     | nextval('form_approval_rule_id_seq'::regclass)       |
|   2 | form_approval_rule       | administration_id | NO          | bigint                   |     |                                                      |
|   3 | form_approval_rule       | form_id           | NO          | bigint                   |     |                                                      |
|-----+--------------------------+-------------------+-------------+--------------------------+-----+------------------------------------------------------|
|   1 | jobs                     | id                | NO          | bigint                   |     | nextval('jobs_id_seq'::regclass)                     |
|   2 | jobs                     | type              | NO          | integer                  |     |                                                      |
|   3 | jobs                     | status            | NO          | integer                  |     |                                                      |
|   4 | jobs                     | attempt           | NO          | integer                  |     |                                                      |
|   5 | jobs                     | result            | YES         | text                     |     |                                                      |
|   6 | jobs                     | info              | YES         | jsonb                    |     |                                                      |
|   7 | jobs                     | created           | NO          | timestamp with time zone |     |                                                      |
|   8 | jobs                     | available         | YES         | timestamp with time zone |     |                                                      |
|   9 | jobs                     | user_id           | NO          | bigint                   |     |                                                      |
|  10 | jobs                     | task_id           | YES         | character varying        |  50 |                                                      |
|-----+--------------------------+-------------------+-------------+--------------------------+-----+------------------------------------------------------|
|   1 | levels                   | id                | NO          | bigint                   |     | nextval('levels_id_seq'::regclass)                   |
|   2 | levels                   | name              | NO          | character varying        |  50 |                                                      |
|   3 | levels                   | level             | NO          | integer                  |     |                                                      |
|   1 | option                   | id                | NO          | bigint                   |     | nextval('option_id_seq'::regclass)                   |
|   2 | option                   | order             | YES         | bigint                   |     |                                                      |
|   3 | option                   | code              | YES         | character varying        | 255 |                                                      |
|   4 | option                   | name              | NO          | text                     |     |                                                      |
|   5 | option                   | other             | NO          | boolean                  |     |                                                      |
|   6 | option                   | question_id       | NO          | bigint                   |     |                                                      |
|-----+--------------------------+-------------------+-------------+--------------------------+-----+------------------------------------------------------|
|   1 | organisation             | id                | NO          | bigint                   |     | nextval('organisation_id_seq'::regclass)             |
|   2 | organisation             | name              | NO          | character varying        | 255 |                                                      |
|-----+--------------------------+-------------------+-------------+--------------------------+-----+------------------------------------------------------|
|   1 | organisation_attribute   | id                | NO          | bigint                   |     | nextval('organisation_attribute_id_seq'::regclass)   |
|   2 | organisation_attribute   | type              | NO          | integer                  |     |                                                      |
|   3 | organisation_attribute   | organisation_id   | NO          | bigint                   |     |                                                      |
|-----+--------------------------+-------------------+-------------+--------------------------+-----+------------------------------------------------------|
|   1 | pending_answer           | id                | NO          | bigint                   |     | nextval('pending_answer_id_seq'::regclass)           |
|   2 | pending_answer           | name              | YES         | text                     |     |                                                      |
|   3 | pending_answer           | value             | YES         | double precision         |     |                                                      |
|   4 | pending_answer           | options           | YES         | jsonb                    |     |                                                      |
|   5 | pending_answer           | created           | NO          | timestamp with time zone |     |                                                      |
|   6 | pending_answer           | updated           | YES         | timestamp with time zone |     |                                                      |
|   7 | pending_answer           | created_by_id     | NO          | bigint                   |     |                                                      |
|   8 | pending_answer           | pending_data_id   | NO          | bigint                   |     |                                                      |
|   9 | pending_answer           | question_id       | NO          | bigint                   |     |                                                      |
|-----+--------------------------+-------------------+-------------+--------------------------+-----+------------------------------------------------------|
|   1 | pending_answer_history   | id                | NO          | bigint                   |     | nextval('pending_answer_history_id_seq'::regclass)   |
|   2 | pending_answer_history   | name              | YES         | text                     |     |                                                      |
|   3 | pending_answer_history   | value             | YES         | double precision         |     |                                                      |
|   4 | pending_answer_history   | options           | YES         | jsonb                    |     |                                                      |
|   5 | pending_answer_history   | created           | NO          | timestamp with time zone |     |                                                      |
|   6 | pending_answer_history   | updated           | YES         | timestamp with time zone |     |                                                      |
|   7 | pending_answer_history   | created_by_id     | NO          | bigint                   |     |                                                      |
|   8 | pending_answer_history   | pending_data_id   | NO          | bigint                   |     |                                                      |
|   9 | pending_answer_history   | question_id       | NO          | bigint                   |     |                                                      |
|-----+--------------------------+-------------------+-------------+--------------------------+-----+------------------------------------------------------|
|   1 | pending_data             | id                | NO          | bigint                   |     | nextval('pending_data_id_seq'::regclass)             |
|   2 | pending_data             | name              | NO          | text                     |     |                                                      |
|   3 | pending_data             | geo               | YES         | jsonb                    |     |                                                      |
|   5 | pending_data             | created           | NO          | timestamp with time zone |     |                                                      |
|   6 | pending_data             | administration_id | NO          | bigint                   |     |                                                      |
|   7 | pending_data             | created_by_id     | NO          | bigint                   |     |                                                      |
|   8 | pending_data             | data_id           | YES         | bigint                   |     |                                                      |
|   9 | pending_data             | form_id           | NO          | bigint                   |     |                                                      |
|  11 | pending_data             | batch_id          | YES         | bigint                   |     |                                                      |
|  12 | pending_data             | updated           | YES         | timestamp with time zone |     |                                                      |
|  13 | pending_data             | updated_by_id     | YES         | bigint                   |     |                                                      |
|-----+--------------------------+-------------------+-------------+--------------------------+-----+------------------------------------------------------|
|   1 | pending_data_approval    | id                | NO          | bigint                   |     | nextval('pending_data_approval_id_seq'::regclass)    |
|   2 | pending_data_approval    | status            | NO          | integer                  |     |                                                      |
|   4 | pending_data_approval    | user_id           | NO          | bigint                   |     |                                                      |
|   5 | pending_data_approval    | level_id          | NO          | bigint                   |     |                                                      |
|   6 | pending_data_approval    | batch_id          | NO          | bigint                   |     |                                                      |
|-----+--------------------------+-------------------+-------------+--------------------------+-----+------------------------------------------------------|
|   1 | question                 | id                | NO          | bigint                   |     | nextval('question_id_seq'::regclass)                 |
|   2 | question                 | order             | YES         | bigint                   |     |                                                      |
|   3 | question                 | text              | NO          | text                     |     |                                                      |
|   4 | question                 | name              | NO          | character varying        | 255 |                                                      |
|   5 | question                 | type              | NO          | integer                  |     |                                                      |
|   6 | question                 | meta              | NO          | boolean                  |     |                                                      |
|   7 | question                 | required          | NO          | boolean                  |     |                                                      |
|   8 | question                 | rule              | YES         | jsonb                    |     |                                                      |
|   9 | question                 | dependency        | YES         | jsonb                    |     |                                                      |
|  10 | question                 | form_id           | NO          | bigint                   |     |                                                      |
|  11 | question                 | question_group_id | NO          | bigint                   |     |                                                      |
|  12 | question                 | api               | YES         | jsonb                    |     |                                                      |
|  13 | question                 | extra             | YES         | jsonb                    |     |                                                      |
|-----+--------------------------+-------------------+-------------+--------------------------+-----+------------------------------------------------------|
|   1 | question_attribute       | id                | NO          | bigint                   |     | nextval('question_attribute_id_seq'::regclass)       |
|   2 | question_attribute       | name              | YES         | text                     |     |                                                      |
|   3 | question_attribute       | attribute         | NO          | integer                  |     |                                                      |
|   4 | question_attribute       | options           | YES         | jsonb                    |     |                                                      |
|   5 | question_attribute       | question_id       | NO          | bigint                   |     |                                                      |
|-----+--------------------------+-------------------+-------------+--------------------------+-----+------------------------------------------------------|
|   1 | question_group           | id                | NO          | bigint                   |     | nextval('question_group_id_seq'::regclass)           |
|   2 | question_group           | name              | NO          | text                     |     |                                                      |
|   3 | question_group           | form_id           | NO          | bigint                   |     |                                                      |
|   4 | question_group           | order             | YES         | bigint                   |     |                                                      |
|-----+--------------------------+-------------------+-------------+--------------------------+-----+------------------------------------------------------|
|   1 | system_user              | id                | NO          | bigint                   |     | nextval('system_user_id_seq'::regclass)              |
|   2 | system_user              | password          | NO          | character varying        | 128 |                                                      |
|   3 | system_user              | last_login        | YES         | timestamp with time zone |     |                                                      |
|   4 | system_user              | is_superuser      | NO          | boolean                  |     |                                                      |
|   5 | system_user              | email             | NO          | character varying        | 254 |                                                      |
|   6 | system_user              | date_joined       | NO          | timestamp with time zone |     |                                                      |
|   7 | system_user              | first_name        | NO          | character varying        |  50 |                                                      |
|   8 | system_user              | last_name         | NO          | character varying        |  50 |                                                      |
|   9 | system_user              | designation       | YES         | character varying        |  50 |                                                      |
|  10 | system_user              | phone_number      | YES         | character varying        |  15 |                                                      |
|  11 | system_user              | updated           | YES         | timestamp with time zone |     |                                                      |
|  12 | system_user              | deleted_at        | YES         | timestamp with time zone |     |                                                      |
|  13 | system_user              | organisation_id   | YES         | bigint                   |     |                                                      |
|  14 | system_user              | trained           | NO          | boolean                  |     |                                                      |
|-----+--------------------------+-------------------+-------------+--------------------------+-----+------------------------------------------------------|
|   1 | user_form                | id                | NO          | bigint                   |     | nextval('user_form_id_seq'::regclass)                |
|   2 | user_form                | form_id           | NO          | bigint                   |     |                                                      |
|   3 | user_form                | user_id           | NO          | bigint                   |     |                                                      |
|-----+--------------------------+-------------------+-------------+--------------------------+-----+------------------------------------------------------|
